rofiqcp/Praktikum-Sistem-Embedded/Modul-06-FreeRTOS-Task/praktikum/STM32/STM32_04_Task_Suspend_Resume/src/main.c
/**
 * ============================================================================
 * FILE: main.c
 * PROJECT: 05-Task_Suspend_Resume
 * 
 * DESKRIPSI PROGRAM:
 * Program ini mendemonstrasikan mekanisme Suspend dan Resume task di FreeRTOS.
 * Suspend adalah cara untuk menghentikan sementara eksekusi task tanpa
 * menghapusnya dari sistem (task tetap ada di memori).
 * 
 * ============================================================================
 * KONSEP DASAR: TASK STATE DAN SUSPEND/RESUME
 * ============================================================================
 * 
 * TASK STATE DI FREERTOS:
 * ┌─────────────────────────────────────────────────────────────────┐
 * │                                                                 │
 * │    ┌─────────┐    vTaskSuspend()    ┌───────────┐               │
 * │    │  READY  │ ──────────────────── │ SUSPENDED │               │
 * │    └────┬────┘                      └─────┬─────┘               │
 * │         │                                 │                     │
 * │  Scheduler                         vTaskResume()                │
 * │  memilih                                  │                     │
 * │         ▼                                 │                     │
 * │    ┌─────────┐                            │                     │
 * │    │ RUNNING │ ◄──────────────────────────┘                     │
 * │    └────┬────┘                                                  │
 * │         │                                                       │
 * │  vTaskDelay()                                                   │
 * │  atau wait                                                      │
 * │         ▼                                                       │
 * │    ┌─────────┐                                                  │
 * │    │ BLOCKED │                                                  │
 * │    └─────────┘                                                  │
 * │                                                                 │
 * └─────────────────────────────────────────────────────────────────┘
 * 
 * SUSPENDED vs BLOCKED:
 * - BLOCKED: Task menunggu event/waktu, akan otomatis ready saat event terjadi
 * - SUSPENDED: Task dihentikan paksa, hanya bisa ready via vTaskResume()
 * 
 * SKENARIO DEMO:
 * 1. Processor Task memproses data terus-menerus
 * 2. Supervisor Task mengawasi dan mensimulasikan deteksi error
 * 3. Saat "error", Supervisor suspend Processor
 * 4. Setelah "error clear", Supervisor resume Processor
 * 5. Button bisa digunakan untuk manual suspend/resume
 * 
 * HARDWARE TARGET: STM32F103C8T6 (Blue Pill)
 * - CPU: 72MHz (HSE 8MHz + PLL x9)
 * - LED: PC13 (aktif LOW) - Toggle oleh Processor
 * - Button: PA0 (pull-up) - Manual kontrol
 * - UART: PA9 (TX), PA10 (RX) @ 115200 baud
 * ============================================================================
 */

/* ========================== HEADER INCLUDES ============================== */
#if defined(STM32F103xB)
#include "stm32f1xx_hal.h"
#elif defined(STM32F401xC) || defined(STM32F411xE)
#include "stm32f4xx_hal.h"
#endif
#include "FreeRTOS.h"
#include "task.h"
#include <stdio.h>
#include <string.h>

/* Deklarasi xPortSysTickHandler untuk fix warning */
extern void xPortSysTickHandler(void);

/* ============================================================================
 * VARIABEL GLOBAL
 * ============================================================================ */

/* Handle UART untuk komunikasi serial debug */
UART_HandleTypeDef huart1;

/* ---------------------------------------------------------------------------
 * TASK HANDLES - KUNCI UNTUK SUSPEND/RESUME
 * ---------------------------------------------------------------------------
 * TaskHandle_t adalah pointer ke Task Control Block (TCB).
 * Digunakan untuk:
 * - vTaskSuspend(handle): Suspend task tertentu
 * - vTaskResume(handle): Resume task tertentu
 * - eTaskGetState(handle): Cek state task
 * 
 * Handle didapat saat xTaskCreate() dengan menyimpan ke parameter terakhir.
 * --------------------------------------------------------------------------- */
TaskHandle_t xDataProcessorHandle = NULL;  /* Handle untuk Processor Task */
TaskHandle_t xSupervisorHandle = NULL;     /* Handle untuk Supervisor Task */

/* Flag error untuk sinkronisasi */
volatile uint8_t errorFlag = 0;            /* 1 = ada error, 0 = normal */

/* ============================================================================
 * DEKLARASI FUNGSI (FUNCTION PROTOTYPES)
 * ============================================================================ */

/* Fungsi konfigurasi sistem dan peripheral */
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);

/* Fungsi utilitas */
void UART_SendString(const char *str);
const char* GetTaskStateString(eTaskState state);

/* Task FreeRTOS */
void vDataProcessorTask(void *pvParameters);  /* Task yang diproses datanya */
void vSupervisorTask(void *pvParameters);     /* Task pengawas */
void vButtonMonitorTask(void *pvParameters);  /* Task monitor tombol */

/* FreeRTOS hook functions */
void vApplicationMallocFailedHook(void);
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName);

/* ============================================================================
 * FUNGSI UTILITAS: UART_SendString
 * ============================================================================ */
void UART_SendString(const char *str) {
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
}

/* ============================================================================
 * FUNGSI UTILITAS: GetTaskStateString
 * ============================================================================
 * Mengkonversi eTaskState enum ke string yang bisa dibaca.
 * 
 * eTaskState adalah enum yang berisi:
 * - eRunning: Task sedang eksekusi di CPU
 * - eReady: Task siap dijalankan, menunggu giliran
 * - eBlocked: Task menunggu event (delay, semaphore, queue, dll)
 * - eSuspended: Task di-suspend secara paksa
 * - eDeleted: Task sudah dihapus (handle masih ada untuk sementara)
 * ============================================================================ */
const char* GetTaskStateString(eTaskState state) {
    switch(state) {
        case eRunning:   return "Running";    /* Sedang berjalan */
        case eReady:     return "Ready";      /* Siap dijalankan */
        case eBlocked:   return "Blocked";    /* Menunggu event */
        case eSuspended: return "SUSPENDED";  /* Di-suspend */
        case eDeleted:   return "Deleted";    /* Sudah dihapus */
        default:         return "Unknown";    /* State tidak dikenal */
    }
}

/* ============================================================================
 * TASK 1: vDataProcessorTask - TASK YANG BISA DI-SUSPEND
 * ============================================================================
 * Task ini mensimulasikan pemrosesan data yang berjalan terus-menerus.
 * Task ini bisa di-suspend oleh Supervisor atau secara manual via button.
 * 
 * KARAKTERISTIK:
 * - Prioritas: 2 (medium)
 * - LED toggle setiap iterasi untuk indikator aktivitas
 * - Saat di-suspend, LED berhenti berkedip
 * - Saat di-resume, melanjutkan dari titik terakhir
 * 
 * PENTING:
 * Saat task di-suspend di tengah eksekusi, state (variabel lokal, register)
 * tetap tersimpan. Saat di-resume, eksekusi dilanjutkan dari titik suspend.
 * ============================================================================ */
void vDataProcessorTask(void *pvParameters) {
    /* ---------------------------------------------------------------------------
     * VARIABEL LOKAL
     * --------------------------------------------------------------------------- */
    uint32_t dataCounter = 0;      /* Counter untuk tracking data yang diproses */
    char buffer[80];               /* Buffer untuk output UART */
    
    /* Cast parameter yang tidak digunakan */
    (void)pvParameters;
    
    UART_SendString("[PROCESSOR] Task dimulai\r\n");
    UART_SendString("[PROCESSOR] LED berkedip = task aktif\r\n");
    UART_SendString("[PROCESSOR] LED diam = task SUSPENDED\r\n\r\n");
    
    /* ---------------------------------------------------------------------------
     * INFINITE LOOP
     * --------------------------------------------------------------------------- */
    for(;;) {
        dataCounter++;
        
        /* -----------------------------------------------------------------------
         * SIMULASI PEMROSESAN DATA
         * -----------------------------------------------------------------------
         * Dalam aplikasi nyata, ini bisa berupa:
         * - Parsing data dari sensor
         * - Encoding/decoding
         * - Komputasi matematis
         * - Protocol handling
         * ----------------------------------------------------------------------- */
        volatile uint32_t i;
        for(i = 0; i < PROCESSING_SIMULATION_LOOPS; i++) {
            /* Simulasi kerja CPU */
        }
        
