rofiqcp/Praktikum-Sistem-Embedded/Modul-06-FreeRTOS-Task/praktikum/STM32/STM32_04_Task_Suspend_Resume/src/main.c
        /* Cetak status pemrosesan */
        sprintf(buffer, "[PROCESSOR] Memproses data paket #%lu\r\n", dataCounter);
        UART_SendString(buffer);
        
        /* -----------------------------------------------------------------------
         * TOGGLE LED - INDIKATOR TASK AKTIF
         * -----------------------------------------------------------------------
         * LED berkedip menunjukkan task sedang berjalan.
         * Saat task di-suspend, LED akan berhenti berkedip.
         * Ini berguna untuk visual debugging - jika LED diam, task suspended.
         * ----------------------------------------------------------------------- */
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
        
        /* Delay sebelum iterasi berikutnya */
        vTaskDelay(pdMS_TO_TICKS(PROCESSOR_TASK_PERIOD_MS));
        
        /* -----------------------------------------------------------------------
         * CATATAN TENTANG SUSPEND SAAT DELAY:
         * -----------------------------------------------------------------------
         * Task bisa di-suspend saat:
         * 1. Sedang berjalan (di loop for di atas)
         * 2. Sedang blocked di vTaskDelay()
         * 
         * Jika di-suspend saat blocked, task tetap suspended setelah delay
         * selesai. Task hanya akan ready kembali setelah di-resume.
         * ----------------------------------------------------------------------- */
    }
}

/* ============================================================================
 * TASK 2: vSupervisorTask - TASK PENGAWAS
 * ============================================================================
 * Task ini mengawasi sistem dan mengontrol Processor Task.
 * Mensimulasikan deteksi error dan recovery.
 * 
 * ALUR SIMULASI:
 * 1. Setiap ERROR_TRIGGER_CYCLE iterasi: simulate error, suspend processor
 * 2. Setelah ERROR_CLEAR_OFFSET iterasi lagi: clear error, resume processor
 * 3. Report status processor setiap iterasi
 * 
 * PRIORITAS:
 * Lebih tinggi dari Processor (3 vs 2) agar selalu bisa preempt
 * dan melakukan suspend kapan saja.
 * ============================================================================ */
void vSupervisorTask(void *pvParameters) {
    /* ---------------------------------------------------------------------------
     * VARIABEL LOKAL
     * --------------------------------------------------------------------------- */
    uint32_t cycleCount = 0;       /* Counter cycle untuk timing error */
    char buffer[100];              /* Buffer untuk output UART */
    eTaskState processorState;     /* State dari Processor Task */
    
    /* Cast parameter yang tidak digunakan */
    (void)pvParameters;
    
    UART_SendString("[SUPERVISOR] Task dimulai\r\n");
    sprintf(buffer, "[SUPERVISOR] Simulasi error setiap %d cycle\r\n", ERROR_TRIGGER_CYCLE);
    UART_SendString(buffer);
    sprintf(buffer, "[SUPERVISOR] Auto-resume setelah %d cycle dari error\r\n\r\n", 
            ERROR_CLEAR_OFFSET);
    UART_SendString(buffer);
    
    /* ---------------------------------------------------------------------------
     * INFINITE LOOP
     * --------------------------------------------------------------------------- */
    for(;;) {
        cycleCount++;
        
        /* -----------------------------------------------------------------------
         * CEK STATE PROCESSOR TASK
         * -----------------------------------------------------------------------
         * eTaskGetState() mengembalikan state task saat ini.
         * 
         * PENTING: Fungsi ini memerlukan INCLUDE_eTaskGetState = 1
         * 
         * Kegunaan:
         * - Monitoring status task
         * - Menentukan apakah perlu resume atau suspend
         * - Debugging dan logging
         * ----------------------------------------------------------------------- */
        processorState = eTaskGetState(xDataProcessorHandle);
        
        /* Format dan cetak status */
        sprintf(buffer, "[SUPERVISOR] Cycle: %lu, Processor: %s\r\n", 
                cycleCount, 
                GetTaskStateString(processorState));
        UART_SendString(buffer);
        
        /* -----------------------------------------------------------------------
         * SIMULASI DETEKSI ERROR - TRIGGER SUSPEND
         * -----------------------------------------------------------------------
         * Setiap ERROR_TRIGGER_CYCLE iterasi, kita "detect error" dan
         * suspend Processor Task.
         * 
         * vTaskSuspend(TaskHandle_t xTaskToSuspend):
         * - Memindahkan task ke state SUSPENDED
         * - Task tidak akan dijadwalkan sampai di-resume
         * - Jika parameter NULL, suspend task yang memanggil (diri sendiri)
         * - Bisa dipanggil dari task manapun dengan prioritas apapun
         * 
         * CATATAN:
         * Kita cek processorState != eSuspended untuk mencegah
         * suspend task yang sudah suspended (tidak ada efek, tapi tidak perlu).
         * ----------------------------------------------------------------------- */
        if((cycleCount % ERROR_TRIGGER_CYCLE == 0) && (processorState != eSuspended)) {
            /* Set flag error */
            errorFlag = 1;
            
            /* Cetak pesan error */
            UART_SendString("\r\n");
            UART_SendString("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n");
            UART_SendString("!!! ERROR TERDETEKSI - SUSPEND PROCESSOR !!!\r\n");
            UART_SendString("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n\r\n");
            
            /* ===================================================================
             * SUSPEND PROCESSOR TASK
             * ===================================================================
             * Ini adalah fungsi kunci dari demo!
             * 
             * Setelah dipanggil:
             * - Processor Task berhenti eksekusi
             * - LED berhenti berkedip
             * - State processor menjadi eSuspended
             * - Task tetap ada di memori, tidak dihapus
             * =================================================================== */
            vTaskSuspend(xDataProcessorHandle);
        }
        
        /* -----------------------------------------------------------------------
         * SIMULASI CLEAR ERROR - TRIGGER RESUME
         * -----------------------------------------------------------------------
         * Setelah ERROR_CLEAR_OFFSET cycle dari trigger error,
         * kita "clear error" dan resume Processor Task.
         * 
         * vTaskResume(TaskHandle_t xTaskToResume):
         * - Memindahkan task dari SUSPENDED ke READY
         * - Task akan dijadwalkan saat prioritasnya tertinggi
         * - Eksekusi dilanjutkan dari titik suspend
         * - Tidak ada efek jika task tidak dalam state SUSPENDED
         * ----------------------------------------------------------------------- */
        if((cycleCount % ERROR_TRIGGER_CYCLE == ERROR_CLEAR_OFFSET) && 
           (processorState == eSuspended)) {
            /* Clear flag error */
            errorFlag = 0;
            
            /* Cetak pesan recovery */
            UART_SendString("\r\n");
            UART_SendString(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\r\n");
            UART_SendString(">>> ERROR CLEARED - RESUME PROCESSOR >>>\r\n");
            UART_SendString(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\r\n\r\n");
            
            /* ===================================================================
             * RESUME PROCESSOR TASK
             * ===================================================================
             * Setelah dipanggil:
             * - Processor Task menjadi READY
             * - Scheduler akan menjalankannya saat giliran
             * - LED mulai berkedip lagi
             * - Eksekusi dilanjutkan dari titik terakhir (setelah vTaskDelay)
             * =================================================================== */
            vTaskResume(xDataProcessorHandle);
        }
        
        /* Delay sampai iterasi berikutnya */
        vTaskDelay(pdMS_TO_TICKS(SUPERVISOR_TASK_PERIOD_MS));
    }
}

/* ============================================================================
 * TASK 3: vButtonMonitorTask - KONTROL MANUAL
 * ============================================================================
 * Task ini memonitor tombol PA0 untuk kontrol manual suspend/resume.
 * 
 * FUNGSI:
 * - Tekan tombol saat Processor running/ready -> Suspend
 * - Tekan tombol saat Processor suspended -> Resume
 * 
 * DEBOUNCING:
 * Tombol mekanik menghasilkan bouncing (osilasi) saat ditekan/dilepas.
 * Kita gunakan delay untuk menunggu bouncing selesai.
 * ============================================================================ */
void vButtonMonitorTask(void *pvParameters) {
    /* ---------------------------------------------------------------------------
     * VARIABEL LOKAL
     * --------------------------------------------------------------------------- */
    uint8_t lastButtonState = 1;   /* State tombol terakhir (1 = tidak ditekan) */
    uint8_t currentButtonState;    /* State tombol saat ini */
    eTaskState processorState;     /* State Processor Task */
    
    /* Cast parameter yang tidak digunakan */
    (void)pvParameters;
    
    /* ---------------------------------------------------------------------------
     * INFINITE LOOP
     * --------------------------------------------------------------------------- */
    for(;;) {
        /* Baca state tombol saat ini */
        currentButtonState = HAL_GPIO_ReadPin(BUTTON_GPIO_PORT, BUTTON_GPIO_PIN);
        
        /* -----------------------------------------------------------------------
         * DETEKSI FALLING EDGE (TOMBOL DITEKAN)
         * -----------------------------------------------------------------------
         * Kita deteksi transisi dari HIGH ke LOW (falling edge).
         * lastButtonState = 1 (tidak ditekan)
         * currentButtonState = 0 (ditekan)
         * ----------------------------------------------------------------------- */
        if(lastButtonState == 1 && currentButtonState == 0) {
            /* Debounce delay - tunggu bouncing selesai */
            vTaskDelay(pdMS_TO_TICKS(BUTTON_DEBOUNCE_MS));
            
