rofiqcp/Praktikum-Sistem-Embedded/Modul-06-FreeRTOS-Task/praktikum/STM32/STM32_04_Task_Suspend_Resume/src/main.c
    /* Enable clock */
    __HAL_RCC_USART1_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* PA9 = TX */
    GPIO_InitStruct.Pin = DEBUG_UART_TX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(DEBUG_UART_TX_PORT, &GPIO_InitStruct);
    
    /* PA10 = RX */
    GPIO_InitStruct.Pin = DEBUG_UART_RX_PIN;
#if defined(STM32F103xB)
    GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
#elif defined(STM32F401xC) || defined(STM32F411xE)
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
#endif
    HAL_GPIO_Init(DEBUG_UART_RX_PORT, &GPIO_InitStruct);

    /* Konfigurasi USART1 */
    huart1.Instance = DEBUG_UART_INSTANCE;
    huart1.Init.BaudRate = DEBUG_UART_BAUDRATE;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart1);
}

/* ============================================================================
 * FUNGSI: vApplicationMallocFailedHook
 * ============================================================================
 */
void vApplicationMallocFailedHook(void) {
    UART_SendString("\r\n!!! FATAL: Malloc gagal! !!!\r\n");
    taskDISABLE_INTERRUPTS();
    for(;;) {
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
        for(volatile uint32_t i = 0; i < 100000; i++);
    }
}

/* ============================================================================
 * FUNGSI: vApplicationStackOverflowHook
 * ============================================================================
 */
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName) {
    (void)xTask;
    UART_SendString("\r\n!!! FATAL: Stack Overflow pada: ");
    UART_SendString(pcTaskName);
    UART_SendString(" !!!\r\n");
    taskDISABLE_INTERRUPTS();
    for(;;) {
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
        for(volatile uint32_t i = 0; i < 50000; i++);
    }
}

/* ============================================================================
 * FUNGSI: SysTick_Handler
 * ============================================================================
 */
void SysTick_Handler(void) {
    HAL_IncTick();
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED) {
        xPortSysTickHandler();
    }
}

/* ============================================================================
 * HAL CALLBACK OVERRIDES
 * ============================================================================
 */
void HAL_MspInit(void) {
#if defined(STM32F103xB)
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_AFIO_REMAP_SWJ_NOJTAG();
#elif defined(STM32F401xC) || defined(STM32F411xE)
    __HAL_RCC_PWR_CLK_ENABLE();
#endif
}

/* ============================================================================
 * FUNGSI: main
 * ============================================================================ */
int main(void) {
    /* Inisialisasi HAL dan peripheral */
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    MX_USART1_UART_Init();

    /* Pesan startup */
    UART_SendString("\r\n");
    UART_SendString("============================================================\r\n");
    UART_SendString("  Program 5: Task Suspend & Resume\r\n");
    UART_SendString("============================================================\r\n");
    UART_SendString("\r\n");
    UART_SendString("DESKRIPSI:\r\n");
    UART_SendString("Demonstrasi mekanisme suspend dan resume task.\r\n");
    UART_SendString("\r\n");
    UART_SendString("KONTROL:\r\n");
    UART_SendString("- Otomatis: Supervisor simulasi error setiap 10 cycle\r\n");
    UART_SendString("- Manual: Tekan tombol PA0 untuk toggle suspend/resume\r\n");
    UART_SendString("\r\n");
    UART_SendString("INDIKATOR:\r\n");
    UART_SendString("- LED berkedip = Processor Task aktif\r\n");
    UART_SendString("- LED diam = Processor Task SUSPENDED\r\n");
    UART_SendString("\r\n");
    UART_SendString("============================================================\r\n\r\n");

    /* ---------------------------------------------------------------------------
     * MEMBUAT TASK FREERTOS
     * ---------------------------------------------------------------------------
     * PENTING: Simpan handle untuk bisa suspend/resume task tersebut.
     * Parameter terakhir xTaskCreate adalah pointer untuk menyimpan handle.
     * --------------------------------------------------------------------------- */
    
    /* Processor Task - bisa di-suspend */
    BaseType_t result1 = xTaskCreate(
        vDataProcessorTask,
        PROCESSOR_TASK_NAME,
        PROCESSOR_TASK_STACK_SIZE,
        NULL,
        PROCESSOR_TASK_PRIORITY,
        &xDataProcessorHandle         /* SIMPAN HANDLE! */
    );
    
    /* Supervisor Task - mengontrol Processor */
    BaseType_t result2 = xTaskCreate(
        vSupervisorTask,
        SUPERVISOR_TASK_NAME,
        SUPERVISOR_TASK_STACK_SIZE,
        NULL,
        SUPERVISOR_TASK_PRIORITY,
        &xSupervisorHandle            /* Simpan handle (opsional) */
    );
    
    /* Button Task - kontrol manual */
    BaseType_t result3 = xTaskCreate(
        vButtonMonitorTask,
        BUTTON_TASK_NAME,
        BUTTON_TASK_STACK_SIZE,
        NULL,
        BUTTON_TASK_PRIORITY,
        NULL                          /* Handle tidak disimpan */
    );
    
    /* Cek hasil pembuatan task */
    if(result1 != pdPASS || result2 != pdPASS || result3 != pdPASS) {
        UART_SendString("ERROR: Gagal membuat task!\r\n");
        while(1) {
            HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
            HAL_Delay(100);
        }
    }
    
    UART_SendString("Task berhasil dibuat. Memulai scheduler...\r\n\r\n");

    /* Start FreeRTOS scheduler */
    vTaskStartScheduler();

    /* Seharusnya tidak sampai sini */
    UART_SendString("ERROR: Scheduler gagal start!\r\n");
    while(1) {
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_GPIO_PIN);
        HAL_Delay(500);
    }
}
